src/cf/InformationRegisters/СвязиОбъектовИСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СвязиОбъектовИСообщенийRMQ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийRMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обменник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящееСообщение</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/НаправленияСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>НаправленияСообщенийRMQ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СвязиОбъектовИСообщенийRMQ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СоздатьНовуюСвязь(Объект, Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Сообщение) = Тип("ДокументСсылка.ВходящееСообщение") Тогда
		Направление = Перечисления.НаправленияСообщенийRMQ.Входящее;
		Обменник = Сообщение.Обменник;
	ИначеЕсли ТипЗнч(Сообщение) = Тип("ДокументСсылка.ИсходящееСообщение") Тогда
		Направление = Перечисления.НаправленияСообщенийRMQ.Исходящее;
		Обменник = Сообщение.Обменник;
	Иначе
		ВызватьИсключение "Передан неизвестный тип сообщения RMQ";
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Направление = Направление;
	МенеджерЗаписи.Сообщение = Сообщение;
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Обменник = Обменник;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция НайтиСообщения(Объект, Направление, Обменник, ИскатьПоследнее = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сообщения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязиОбъектовИСообщенийRMQ.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.СвязиОбъектовИСообщенийRMQ КАК СвязиОбъектовИСообщенийRMQ
		|ГДЕ
		|	СвязиОбъектовИСообщенийRMQ.Объект = &Объект
		|	И СвязиОбъектовИСообщенийRMQ.Направление = &Направление
		|	И СвязиОбъектовИСообщенийRMQ.Обменник = &Обменник
		|
		|УПОРЯДОЧИТЬ ПО
		|	СвязиОбъектовИСообщенийRMQ.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.УстановитьПараметр("Обменник", Обменник);
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если ИскатьПоследнее Тогда
		Если Выборка.Следующий() Тогда
			Сообщения.Добавить(Выборка.Сообщение);
		КонецЕсли;
	Иначе
		Пока Выборка.Следующий() Цикл
			Сообщения.Добавить(Выборка.Сообщение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Сообщения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
